K1, M, K2, P2, N2 = map(int, input().split())

# K1 - номер квартиры 1
# М - количество этажей

# K2 - номер квартиры 2
# P2 - номер подъезда 2
# N2 - номер этажа 2

# N1 - номер этажа для квартиры 1
# P2 - номер подъезда для квартиры 1

# вычислить количество квартир на этаже

# K1 = 89
# M = 20
# K2 = 41
# P2 = 1
# N2 = 11


cnt_K = 0
P1 = -1
N1 = -1

if K1 == K2:
    print(P2, N2)
    exit(0)


if M == 1:
    print(K1, M)
    exit(0)

if P2 > 1:
    print(0, 0)
    exit(0)

# elif P2 == 1:
#     if N2 > 1:
#     cnt_K = K2 // N2 + 1
#     P1 = K1 // (cnt_K * M)  + 1
#     print(K1, cnt_K, M)
#     if P1 > 0:
#         N1 = (K1 % (M * cnt_K)) // cnt_K + 1 
#         print(P1, N1)
#         exit(0)
#     else:
#         print(-1, -1)







